HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxI2c_regdef.h
/**
 * \file IfxI2c_regdef.h
 * \brief
 * \copyright Copyright (c) 2014 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC27XA_TS_V3.0.1.R2
 * Specification: TC27xA_TS_V3.0.1_SFR_OPEN_MARKET.xml (Revision: V3.0.1)
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_I2c I2c
 * \ingroup IfxLld
 * 
 * \defgroup IfxLld_I2c_Bitfields Bitfields
 * \ingroup IfxLld_I2c
 * 
 * \defgroup IfxLld_I2c_union Union
 * \ingroup IfxLld_I2c
 * 
 * \defgroup IfxLld_I2c_struct Struct
 * \ingroup IfxLld_I2c
 * 
 */
#ifndef IFXI2C_REGDEF_H
#define IFXI2C_REGDEF_H 1
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/
/** \addtogroup IfxLld_I2c_Bitfields
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef struct _Ifx_I2C_ACCEN0_Bits
{
    unsigned int EN0:1;                     /**< \brief [0:0] Access Enable for Master TAG ID n (rw) */
    unsigned int EN1:1;                     /**< \brief [1:1] Access Enable for Master TAG ID n (rw) */
    unsigned int EN2:1;                     /**< \brief [2:2] Access Enable for Master TAG ID n (rw) */
    unsigned int EN3:1;                     /**< \brief [3:3] Access Enable for Master TAG ID n (rw) */
    unsigned int EN4:1;                     /**< \brief [4:4] Access Enable for Master TAG ID n (rw) */
    unsigned int EN5:1;                     /**< \brief [5:5] Access Enable for Master TAG ID n (rw) */
    unsigned int EN6:1;                     /**< \brief [6:6] Access Enable for Master TAG ID n (rw) */
    unsigned int EN7:1;                     /**< \brief [7:7] Access Enable for Master TAG ID n (rw) */
    unsigned int EN8:1;                     /**< \brief [8:8] Access Enable for Master TAG ID n (rw) */
    unsigned int EN9:1;                     /**< \brief [9:9] Access Enable for Master TAG ID n (rw) */
    unsigned int EN10:1;                    /**< \brief [10:10] Access Enable for Master TAG ID n (rw) */
    unsigned int EN11:1;                    /**< \brief [11:11] Access Enable for Master TAG ID n (rw) */
    unsigned int EN12:1;                    /**< \brief [12:12] Access Enable for Master TAG ID n (rw) */
    unsigned int EN13:1;                    /**< \brief [13:13] Access Enable for Master TAG ID n (rw) */
    unsigned int EN14:1;                    /**< \brief [14:14] Access Enable for Master TAG ID n (rw) */
    unsigned int EN15:1;                    /**< \brief [15:15] Access Enable for Master TAG ID n (rw) */
    unsigned int EN16:1;                    /**< \brief [16:16] Access Enable for Master TAG ID n (rw) */
    unsigned int EN17:1;                    /**< \brief [17:17] Access Enable for Master TAG ID n (rw) */
    unsigned int EN18:1;                    /**< \brief [18:18] Access Enable for Master TAG ID n (rw) */
    unsigned int EN19:1;                    /**< \brief [19:19] Access Enable for Master TAG ID n (rw) */
    unsigned int EN20:1;                    /**< \brief [20:20] Access Enable for Master TAG ID n (rw) */
    unsigned int EN21:1;                    /**< \brief [21:21] Access Enable for Master TAG ID n (rw) */
    unsigned int EN22:1;                    /**< \brief [22:22] Access Enable for Master TAG ID n (rw) */
    unsigned int EN23:1;                    /**< \brief [23:23] Access Enable for Master TAG ID n (rw) */
    unsigned int EN24:1;                    /**< \brief [24:24] Access Enable for Master TAG ID n (rw) */
    unsigned int EN25:1;                    /**< \brief [25:25] Access Enable for Master TAG ID n (rw) */
    unsigned int EN26:1;                    /**< \brief [26:26] Access Enable for Master TAG ID n (rw) */
    unsigned int EN27:1;                    /**< \brief [27:27] Access Enable for Master TAG ID n (rw) */
    unsigned int EN28:1;                    /**< \brief [28:28] Access Enable for Master TAG ID n (rw) */
    unsigned int EN29:1;                    /**< \brief [29:29] Access Enable for Master TAG ID n (rw) */
    unsigned int EN30:1;                    /**< \brief [30:30] Access Enable for Master TAG ID n (rw) */
    unsigned int EN31:1;                    /**< \brief [31:31] Access Enable for Master TAG ID n (rw) */
} Ifx_I2C_ACCEN0_Bits;

/** \\brief  Access Enable Register 1 */
typedef struct _Ifx_I2C_ACCEN1_Bits
{
    unsigned int reserved_0:32;             /**< \brief \internal Reserved */
} Ifx_I2C_ACCEN1_Bits;

/** \\brief  Address Configuration Register */
typedef struct _Ifx_I2C_ADDRCFG_Bits
{
    unsigned int ADR:10;                    /**< \brief [9:0] I2C-bus Device Address (rw) */
    unsigned int reserved_10:6;             /**< \brief \internal Reserved */
    unsigned int TBAM:1;                    /**< \brief [16:16] Ten Bit Address Mode (rw) */
    unsigned int GCE:1;                     /**< \brief [17:17] General Call Enable (rw) */
    unsigned int MCE:1;                     /**< \brief [18:18] Master Code Enable (rw) */
    unsigned int MnS:1;                     /**< \brief [19:19] Master / not Slave (rw) */
    unsigned int SONA:1;                    /**< \brief [20:20] Stop on Not-acknowledge (rw) */
    unsigned int SOPE:1;                    /**< \brief [21:21] Stop on Packet End (rw) */
    unsigned int reserved_22:10;            /**< \brief \internal Reserved */
} Ifx_I2C_ADDRCFG_Bits;

/** \\brief  Bus Status Register */
typedef struct _Ifx_I2C_BUSSTAT_Bits
{
    unsigned int BS:2;                      /**< \brief [1:0] Bus Status (rh) */
    unsigned int RnW:1;                     /**< \brief [2:2] Read/not Write (rh) */
    unsigned int reserved_3:29;             /**< \brief \internal Reserved */
} Ifx_I2C_BUSSTAT_Bits;

/** \\brief  Clock Control 1 Register */
typedef struct _Ifx_I2C_CLC1_Bits
{
    unsigned int DISR:1;                    /**< \brief [0:0] Module Disable Request Bit (rw) */
    unsigned int DISS:1;                    /**< \brief [1:1] Module Disable Status Bit (rh) */
    unsigned int SPEN:1;                    /**< \brief [2:2] Module Suspend Enable Bit for OCDS (rw) */
    unsigned int EDIS:1;                    /**< \brief [3:3] External Request Disable (rw) */
    unsigned int SBWE:1;                    /**< \brief [4:4] Module Suspend Bit Write Enable for OCDS (w) */
    unsigned int FSOE:1;                    /**< \brief [5:5] Fast Switch Off Enable (rw) */
    unsigned int reserved_6:2;              /**< \brief \internal Reserved */
    unsigned int RMC:8;                     /**< \brief [15:8] Clock Divider for Standard Run Mode (rwh) */
    unsigned int ORMC:8;                    /**< \brief [23:16] Clock Divider for Optional Run Mode (AHB peripherals) (rwh) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_I2C_CLC1_Bits;

/** \\brief  Clock Control Register */
typedef struct _Ifx_I2C_CLC_Bits
{
    unsigned int DISR:1;                    /**< \brief [0:0] Module Disable Request Bit (rw) */
    unsigned int DISS:1;                    /**< \brief [1:1] Module Disable Status Bit (rh) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_I2C_CLC_Bits;

/** \\brief  End Data Control Register */
typedef struct _Ifx_I2C_ENDDCTRL_Bits
{
    unsigned int SETRSC:1;                  /**< \brief [0:0] Set Restart Condition (w) */
    unsigned int SETEND:1;                  /**< \brief [1:1] Set End of Transmission (w) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_I2C_ENDDCTRL_Bits;

/** \\brief  Error Interrupt Request Source Clear Register */
typedef struct _Ifx_I2C_ERRIRQSC_Bits
{
    unsigned int RXF_UFL:1;                 /**< \brief [0:0] RX FIFO Underflow (w) */
    unsigned int RXF_OFL:1;                 /**< \brief [1:1] RX FIFO Overflow (w) */
    unsigned int TXF_UFL:1;                 /**< \brief [2:2] TX FIFO Underflow (w) */
    unsigned int TXF_OFL:1;                 /**< \brief [3:3] TX FIFO Overflow (w) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_I2C_ERRIRQSC_Bits;

/** \\brief  Error Interrupt Request Source Mask Register */
typedef struct _Ifx_I2C_ERRIRQSM_Bits
{
    unsigned int RXF_UFL:1;                 /**< \brief [0:0] RX FIFO Underflow (rw) */
    unsigned int RXF_OFL:1;                 /**< \brief [1:1] RX FIFO Overflow (rw) */
    unsigned int TXF_UFL:1;                 /**< \brief [2:2] TX FIFO Underflow (rw) */
    unsigned int TXF_OFL:1;                 /**< \brief [3:3] TX FIFO Overflow (rw) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_I2C_ERRIRQSM_Bits;

